Repository: Legion495/install-waterfox-linux
Catalog: src/locales/CLI/*.po
Languages: pl

source: usage:
pl: użycie:

source: options
pl: opcje

source: show this help message and exit
pl: wyświetla ten tekst i kończy pracę

source: cannot have multiple subparser arguments
pl: nie może mieć wielu argumentów subparsera

source: unrecognized arguments: %s
pl: nierozpoznane argumenty: %s

source: not allowed with argument %s
pl: niedozwolone z argumentem %s

source: ignored explicit argument %r
pl: zignorowano argument %r

source: the following arguments are required: %s
pl: wymagane są następujące argumenty: %s

source: one of the arguments %s is required
pl: jeden z argumentów %s jest wymagany

source: expected one argument
pl: oczekiwano jednego argumentu

source: expected at most one argument
pl: oczekiwano co najwyżej jednego argumentu

source: expected at least one argument
pl: oczekiwano co najmniej jednego argumentu

source: expected %s argument
pl: oczekiwano %s argumentu

source: unexpected option string: %s
pl: nieoczekiwany ciąg opcji: %s

source: %r is not callable
pl: %r jest niemożliwa do wywołania

source: invalid %(type)s value: %(value)r
pl: nieprawidłowa wartość %(type)s: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
pl: nieprawidłowy wybór: %(value)r (wybierz z %(choices)s)

source: %(prog)s: error: %(message)s
pl: %(prog)s: błąd: %(message)s

source: Yes
pl: Tak

source: Enter your choice:
pl: Wprowadź swój wybór:

source: Invalid option. Please try again.
pl: Nieprawidłowa opcja. Proszę spróbować ponownie.

source: No
pl: Nie

source: Installation and uninstallation script for Waterfox
pl: Skrypt instalacyjny i dezinstalacyjny dla Waterfoxa

source: display script version
pl: wyświetla wersję skryptu

source: set path to directory of installable package(s)
pl: ustawia ścieżkę do katalogu z instalowalnymi paczkami

source: set installation path (folder with package name will be here)
pl: ustawia ścieżkę instalacyjną (folder z nazwą paczki będzie się tam znajdował)

source: enable unattended installation mode (valid configuration file and full source path is required)
pl: aktywuje instalację nienadzorowaną (wymagany jest prawidłowy plik konfiguracyjny i pełna ścieżka do źródła)

source: Install
pl: Zainstaluj

source: Uninstall
pl: Odinstaluj

source: What do you want to do with Waterfox?
pl: Co chcesz zrobić z Waterfoxem?

source: Quit
pl: Wyjdź

source: This program was created for installing Waterfox only for one user, because updater of this package doesn't work correctly for root user. If you wanted to install it for all users, then go to {URL} for more information, otherwise run this program again as normal user.
pl: Ten program został stworzony do instalacji Waterfoxa jedynie dla jednego użytkownika, ponieważ aktualizator tej paczki nie działa prawidłowo dla administratora (użytkownika root). Jeżeli chciałeś go zainstalować dla wszystkich użytkowników, to wejdź na {URL} po więcej informacji, a w przeciwnym przypadku uruchom ten program ponownie jako zwykły użytkownik.

source: The specified path does not exist!
pl: Podana ścieżka nie istnieje!

source: Detecting installable packages...
pl: Wykrywanie instalowalnych paczek...

source: No installable packages found.
pl: Brak instalowalnych paczek.

source: Please place this script next to the tarball/AppImage packages or launch it again with flag -sp=<path>.
pl: Proszę umieścić ten skrypt obok paczek tar/AppImage lub uruchomić go ponownie z flagą -sp=<ścieżka>.

source: Which package are you interested in?
pl: Która paczka ciebie interesuje?

source: None
pl: Żadna

source: Which package do you want to install?
pl: Którą paczkę chcesz zainstalować?

source: Do you want to add a desktop shortcut?
pl: Czy chcesz dodać skrót na pulpicie?

source: Do you want to use system's dictionaries?
pl: Czy chcesz korzystać ze słowników systemowych?

source: Do you want to remove tarball/AppImage package after completing the installation?
pl: Czy chcesz usunąć paczkę tar/AppImage po zakończeniu instalacji?

source: Detecting installed packages...
pl: Wykrywanie zainstalowanych paczek....

source: No installed packages found.
pl: Brak zainstalowanych paczek.

source: Please launch script again with flag -ip=<path>.
pl: Proszę uruchomić skrypt ponownie z flagą -ip=<ścieżka>.

source: Which package do you want to uninstall?
pl: Którą paczkę chcesz odinstalować?

source: Detected Waterfox {chosenPackageType}.
pl: Wykryto Waterfox {chosenPackageType}.

source: Are you sure that you want to uninstall Waterfox {chosenPackageType}?
pl: Czy jesteś pewny(a), że chcesz odinstalować Waterfox {chosenPackageType}?

source: Do you want to remove file with installer settings?
pl: Czy chcesz usunąć plik z ustawieniami instalatora?
